#coding:utf-8

# 图片及视频检测结果保存路径
save_path = 'save_data'

# 使用的模型路径
model_path = 'models/best.pt'

names = {0: 'pl80', 1: 'p6', 2: 'p5', 3: 'pm55', 4: 'pl60', 5: 'ip', 6: 'p11', 7: 'i2r', 8: 'p23', 9: 'pg', 10: 'il80', 11: 'ph4', 12: 'i4', 13: 'pl70', 14: 'pne', 15: 'ph4.5', 16: 'p12', 17: 'p3', 18: 'pl5', 19: 'w13', 20: 'i4l', 21: 'pl30', 22: 'p10', 23: 'pn', 24: 'w55', 25: 'p26', 26: 'p13', 27: 'pr40', 28: 'pl20', 29: 'pm30', 30: 'pl40', 31: 'i2', 32: 'pl120', 33: 'w32', 34: 'ph5', 35: 'il60', 36: 'w57', 37: 'pl100', 38: 'w59', 39: 'il100', 40: 'p19', 41: 'pm20', 42: 'i5', 43: 'p27', 44: 'pl50'}

CH_names = ['限速80', '禁止自行车同行', '禁止掉头', '限重55吨', '限速60', '人行横道', '禁止鸣笛', '非机动车行进标志', '禁止左转', '减速让行', '最低限速80', '限高4米', '机动车行驶', '限速70', '禁止驶入', '限高4.5米', '禁止摩托车通行', '禁止大型客车通行', '禁止人力车通行', '十字交叉', '机动车行进标志', '限速30', '禁止机动车通行', '禁止长时间停车', '注意儿童', '禁止货车通行', '禁止某两种车辆通行', '解除限制速度', '限速20', '限重30吨', '限速40', '非机动车行驶', '限速120', '施工', '限高5米', '最低限速60', '注意行人', '限速100', '注意合流', '最低限速100', '禁止右转', '限重20吨', '靠右侧道路行驶', '禁止危险品车辆通行', '限速50']